Revit 2027 API
CoordinationModelLinkUtils.SetVisibilityOverride Method
 Sets the visibility override for the provided Coordination Model instance or type. A value of true means that the graphics are visible.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetVisibilityOverride(
	Document document,
	View view,
	Element coordinationModelTypeOrInstance,
	bool visible
)
Public Shared Sub SetVisibilityOverride (
	document As Document,
	view As View,
	coordinationModelTypeOrInstance As Element,
	visible As Boolean
)
public:
static void SetVisibilityOverride(
	Document^ document,
	View^ view,
	Element^ coordinationModelTypeOrInstance,
	bool visible
)
static member SetVisibilityOverride :
        document : Document *
        view : View *
        coordinationModelTypeOrInstance : Element *
        visible : bool -> unit
Parameters
document Document
 The document.
view View
 The view.
coordinationModelTypeOrInstance Element
 The Coordination Model instance or type element.
visible Boolean
 Sets the visibility override for the provided Coordination Model instance or type. A value of true means that the graphics are visible.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element coordinationModelTypeOrInstance was not found in the given document. -or- The provided element is not a Coordination Model instance or type.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 By default, the visibility setting has no override and its value is true.
 This setting does not reflect the actual visibility in canvas. For example, if a Coordination Model instance has the visibility setting on true, it won't be visible if its Coordination Model type is hidden.
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace